[Author]
txtLogAuthor=Translated by Mr.X

[MainWindow]
txtSizeb=B
txtSizeKb=Kb
txtSizeMb=Mb
txtSizeGb=Gb

txtButtonGroupItemWindowsUpdate=Windows Update
txtButtonGroupItemInstalled=Installed
txtButtonGroupItemHidden=Hidden
txtButtonGroupItemHistory=Update History

txtButtonHintCheckUpdate=Check for updates
txtButtonHintDownloadOnly=Download only, no install
txtButtonHintInstall=Install updates
txtButtonHintUninstall=Uninstall updates
txtButtonHintToHide=Hide updates
txtButtonHintToShow=Unhide hidden updates
txtButtonHintCopyURL=Copy direct file download link(s) to clipboard. Hint: paste contents to a notpad sheet to visualize download links of exe, cab and psf files.
txtButtonHintCancel=Cancel

txtGroupBoxSearchUpdates=Search for updates
txtLabelUpdateService=Update service:
txtCheckBoxIncludeWUDrivers=Include drivers
txtCheckBoxSuperseded=Include superseded
txtCheckBoxOfflineMode=Offline mode

txtGroupBoxAU=Automatic Updates
txtComboBoxAUAutoUpdate=Automatically
txtComboBoxAUNoAutoUpdate=Disabled
txtComboBoxAUNotify=Notification mode
txtComboBoxAUDownloadOnly=Download only
txtComboBoxAUScheduled=Scheduled
txtComboBoxAUByAdmin=Managed by Administrator
txtComboBoxScheduledDaily=Daily

txtCheckBoxSelectAll=Select all
txtCheckBoxSelectedByWindowsUpdate=Selected by Windows Update
txtLabelUpdateAttributes=Attributes: %s
txtLabelHintUpdateAttributesD=[ D ] - Downloaded
txtLabelHintUpdateAttributesI=[ I ] - Installed
txtLabelHintUpdateAttributesM=[ M ] - Mandatory
txtLabelHintUpdateAttributesU=[ U ] - Uninstallable
txtLabelHintUpdateAttributesH=[ H ] - Hidden
txtLabelHintUpdateAttributesB=[ B ] - Beta

txtListViewColumnTitle=Title
txtListViewColumnCategory=Category
txtListViewColumnKBArticle=KB article
txtListViewColumnDate=Date
txtListViewColumnSize=Size
txtListViewColunmResult=Result
txtListViewColunmClientApplicationID=Applications ID

txtLabelSearchUpdates=Searching for updates
txtLabelDownloadUpdates=Downloading %d / %d
txtLabelInstallUpdates=Installing %d / %d
txtLabelUnInstallUpdates=Uninstalling %d / %d

txtUpdateHintDriverClass=Class
txtUpdateHintDriverHardwareID=Hardware ID
txtUpdateHintDriverManufacturer=Manufacturer
txtUpdateHintDriverModel=Model
txtUpdateHintDriverProvider=Provider
txtUpdateHintDriverDate=Date

txtMessageboxDescriptionRunWU=Windows Update service required. Run WU service now?
txtMessageboxDescriptionRebootRequired=To complete a system reboot is required. Reboot now?

[Log]
txtLogSearchStarted=Searching for updates
txtLogSearchUpdateWarning=Warning: %s (0x%s)

txtLogDownloadStarted=Downloading updates
txtLogDownloadUpdate=Downloading "%s"...

txtLogInstallationStarted=Installing updates
txtLogInstallationUpdate=Installing "%s"...

txtLogUnInstallationStarted=Uninstalling updates
txtLogUnInstallationUpdate=Uninstalling "%s"...
txtLogUnInstallationUpdateExceptionTryWusa=Attempting to unistall using command "wusa /uninstall /kb:%s"...

txtLogOperationResultNotStarted=Not started
txtLogOperationResultInProgress=In progress
txtLogOperationResultSucceeded=Succeeded
txtLogOperationResultSucceededWithErrors=Succeeded with errors
txtLogOperationResultFailed=Failed
txtLogOperationResultAborted=Aborted

txtLogUpdateIsNotUninstallable="%s" is not uninstallable. Skipping
txtLogUpdateIsNotDownloaded="%s" not downloaded. Skipping
txtLogUpdateToHide="%s" able to hide
txtLogUpdateToShow="%s" able to unhide
txtLogUpdateCopyUrls=Links copied to clipboard
txtLogUpdateException=An error has occurred: 0x%s %s
txtLogNotSelectedItem=No item selected

txtLogVersionWUA=Windows Update Agent version: %s
txtLogOfflineMode=Installed in Offline mode. Updates will be checked from the "%s" file

txtLogAUServiceEnabledTrue=Windows Update Service enabled
txtLogAUServiceEnabledFalse=Windows Update Service disabled
txtLogAUServiceStart=Start Windows Update Service